status/2021/01oct21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>25 September 2021 - 01 October 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">25 September 2021 - 01 October 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org470d314">1. MIT OCW</a>
<ul>
<li><a href="#org96aafde">1.1. 18.01 - Single Variable Calculus</a>
<ul>
<li><a href="#org23388ba">1.1.1. Sessions 29-31</a></li>
</ul>
</li>
<li><a href="#org3a7280d">1.2. 8.01 - Physics I - Classical Mechanics</a>
<ul>
<li><a href="#org031a7ad">1.2.1. Sessions 13-17</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc887554">2. Marble Computation</a>
<ul>
<li><a href="#org43cc66b">2.1. Next Steps</a>
<ul>
<li><a href="#orgbe9da33">2.1.1. Continue Reversible Computation Study</a></li>
<li><a href="#orgbc706a5">2.1.2. Prototype Marble inverter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc220b65">3. ca-r</a>
<ul>
<li><a href="#org8caef80">3.1. Next Step</a></li>
</ul>
</li>
<li><a href="#org9c2645b">4. us-index-map</a>
<ul>
<li><a href="#orgb0845db">4.1. error analysis</a></li>
</ul>
</li>
<li><a href="#org87a723e">5. Sun Ultra 10</a>
<ul>
<li><a href="#org3915e75">5.1. Next steps</a>
<ul>
<li><a href="#orge97418d">5.1.1. Serial debug</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8678bf4">6. Apple iMac G4</a>
<ul>
<li><a href="#org1374122">6.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orga96bb71">7. Davies Brothel</a></li>
<li><a href="#orgb83abaf">8. Linux Audio</a>
<ul>
<li><a href="#orga6858d0">8.1. pvanal to spectrogram</a>
<ul>
<li><a href="#org8b442a0">8.1.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org9e5d06b">8.2. CSound programming.</a>
<ul>
<li><a href="#orgbac7ffd">8.2.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#orgc9a4c8e">8.3. Faust programming</a>
<ul>
<li><a href="#org5d02b7a">8.3.1. Next Steps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7b776d5">9. EPICS</a>
<ul>
<li><a href="#orgdd2127f">9.1. Next steps</a>
<ul>
<li><a href="#orge2d0eea">9.1.1. u3scpi network port testing</a></li>
<li><a href="#orga930042">9.1.2. initial EPICS interface</a></li>
<li><a href="#orgfa296c3">9.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5606a7c">10. Brini Tracker II</a>
<ul>
<li><a href="#orgc4fb97d">10.1. Next steps</a>
<ul>
<li><a href="#org253388d">10.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#orga5d3e99">10.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org2ce9ee0">10.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org19e11b8">11. wktcolor</a>
<ul>
<li><a href="#orgf0e76a3">11.1. Next steps</a>
<ul>
<li><a href="#orgb552341">11.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org403a85f">12. wktplot</a>
<ul>
<li><a href="#org8ae18a1">12.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org1af3d97">13. AMDGPU</a>
<ul>
<li><a href="#orgba5e54d">13.1. Next step</a>
<ul>
<li><a href="#orgd1d3c5f">13.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org39412fa">14. Ninja v Make</a>
<ul>
<li><a href="#org60d2c89">14.1. Next Step</a>
<ul>
<li><a href="#org4de8c7f">14.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org56bef99">15. GMP Forth</a>
<ul>
<li><a href="#orgca3fd04">15.1. Need to think about adding floating point support</a></li>
<li><a href="#org2b96571">15.2. Port to non-Linux OS</a></li>
</ul>
</li>
<li><a href="#org81ab5bb">16. Swocer</a>
<ul>
<li><a href="#orgf6ca298">16.1. Most crashing addressed</a></li>
<li><a href="#orgf5faa45">16.2. Added outline for 'bottle' test</a></li>
<li><a href="#orgfb4932d">16.3. Next steps</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
October already?
</p>

<div id="outline-container-org470d314" class="outline-2">
<h2 id="org470d314"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org96aafde" class="outline-3">
<h3 id="org96aafde"><span class="section-number-3">1.1.</span> 18.01 - Single Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org23388ba" class="outline-4">
<h4 id="org23388ba"><span class="section-number-4">1.1.1.</span> Sessions 29-31</h4>
</div>
</div>
<div id="outline-container-org3a7280d" class="outline-3">
<h3 id="org3a7280d"><span class="section-number-3">1.2.</span> 8.01 - Physics I - Classical Mechanics</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org031a7ad" class="outline-4">
<h4 id="org031a7ad"><span class="section-number-4">1.2.1.</span> Sessions 13-17</h4>
</div>
</div>
</div>
<div id="outline-container-orgc887554" class="outline-2">
<h2 id="orgc887554"><span class="section-number-2">2.</span> Marble Computation</h2>
<div class="outline-text-2" id="text-2">
<p>
Collected materials (thin copper plate, copper PCB blanks) for prototyping.
</p>
</div>
<div id="outline-container-org43cc66b" class="outline-3">
<h3 id="org43cc66b"><span class="section-number-3">2.1.</span> Next Steps</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgbe9da33" class="outline-4">
<h4 id="orgbe9da33"><span class="section-number-4">2.1.1.</span> Continue Reversible Computation Study</h4>
</div>
<div id="outline-container-orgbc706a5" class="outline-4">
<h4 id="orgbc706a5"><span class="section-number-4">2.1.2.</span> Prototype Marble inverter</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Using dual rail differential logic (left/,right/1), an inverter
merely switches sides. I think little "kickers" on the side should
be sufficient for a purely mechanical approach.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc220b65" class="outline-2">
<h2 id="orgc220b65"><span class="section-number-2">3.</span> ca-r</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://github.com/daniel-kelley/ca-r/issues/29">https://github.com/daniel-kelley/ca-r/issues/29</a>
</p>
</div>
<div id="outline-container-org8caef80" class="outline-3">
<h3 id="org8caef80"><span class="section-number-3">3.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-3-1">
<p>
None.
</p>
</div>
</div>
</div>
<div id="outline-container-org9c2645b" class="outline-2">
<h2 id="org9c2645b"><span class="section-number-2">4.</span> us-index-map</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgb0845db" class="outline-3">
<h3 id="orgb0845db"><span class="section-number-3">4.1.</span> error analysis</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Started an error analysis on the USGS topomaps<sub>all.csv</sub> index file. Nothing abvious pops up,
and the error reported by Maureen would be impossible to catch anyway.
</p>
</div>
</div>
</div>
<div id="outline-container-org87a723e" class="outline-2">
<h2 id="org87a723e"><span class="section-number-2">5.</span> Sun Ultra 10</h2>
<div class="outline-text-2" id="text-5">
<p>
Trying to see what state it is in. Fires up but no video. Need DB25M to
debug over serial port.
</p>
</div>
<div id="outline-container-org3915e75" class="outline-3">
<h3 id="org3915e75"><span class="section-number-3">5.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orge97418d" class="outline-4">
<h4 id="orge97418d"><span class="section-number-4">5.1.1.</span> Serial debug</h4>
</div>
</div>
</div>
<div id="outline-container-org8678bf4" class="outline-2">
<h2 id="org8678bf4"><span class="section-number-2">6.</span> Apple iMac G4</h2>
<div class="outline-text-2" id="text-6">
<p>
Building userland may be a PITA due to lack of RAM. Build would often
segfault.
</p>
</div>
<div id="outline-container-org1374122" class="outline-3">
<h3 id="org1374122"><span class="section-number-3">6.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Not sure.
</p>
</div>
</div>
</div>

<div id="outline-container-orga96bb71" class="outline-2">
<h2 id="orga96bb71"><span class="section-number-2">7.</span> Davies Brothel</h2>
<div class="outline-text-2" id="text-7">
<p>
Next (plea) hearing: 28 October; Department 37
</p>
</div>
</div>
<div id="outline-container-orgb83abaf" class="outline-2">
<h2 id="orgb83abaf"><span class="section-number-2">8.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orga6858d0" class="outline-3">
<h3 id="orga6858d0"><span class="section-number-3">8.1.</span> pvanal to spectrogram</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Enough of libriffr and libpvocf work to start pvoctool
<a href="https://github.com/daniel-kelley/pvoctool">https://github.com/daniel-kelley/pvoctool</a>. Have HDF5 output and
text delimited output for octave. Can import PVOC data to octave
spectrogram for display.
</p>
</div>
<div id="outline-container-org8b442a0" class="outline-4">
<h4 id="org8b442a0"><span class="section-number-4">8.1.1.</span> Next steps</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
Loop analysis
</p>
</div>
</div>
</div>
<div id="outline-container-org9e5d06b" class="outline-3">
<h3 id="org9e5d06b"><span class="section-number-3">8.2.</span> CSound programming.</h3>
<div class="outline-text-3" id="text-8-2">
<p>
The FORTRAN of computer music. Getting up to speed.
</p>
</div>
<div id="outline-container-orgbac7ffd" class="outline-4">
<h4 id="orgbac7ffd"><span class="section-number-4">8.2.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-8-2-1">
</div>
<ol class="org-ol">
<li><a id="orgbe6675e"></a>loscil demo<br /></li>
<li><a id="orga937777"></a>spectrogram loop point analysis<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgc9a4c8e" class="outline-3">
<h3 id="orgc9a4c8e"><span class="section-number-3">8.3.</span> Faust programming</h3>
<div class="outline-text-3" id="text-8-3">
</div>
<div id="outline-container-org5d02b7a" class="outline-4">
<h4 id="org5d02b7a"><span class="section-number-4">8.3.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-8-3-1">
</div>
<ol class="org-ol">
<li><a id="orgdccf6fc"></a>GAC Patch save/restore<br /></li>
<li><a id="org26cfff2"></a>LV2 autopatcher<br />
<div class="outline-text-5" id="text-8-3-1-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</li>
<li><a id="org96b9d18"></a>OSC control surface<br />
<div class="outline-text-5" id="text-8-3-1-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</li>
<li><a id="org181cfa3"></a>Faust/csound<br />
<div class="outline-text-5" id="text-8-3-1-4">
<p>
See if a faust generated unit works.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org7b776d5" class="outline-2">
<h2 id="org7b776d5"><span class="section-number-2">9.</span> EPICS</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgdd2127f" class="outline-3">
<h3 id="orgdd2127f"><span class="section-number-3">9.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orge2d0eea" class="outline-4">
<h4 id="orge2d0eea"><span class="section-number-4">9.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-orga930042" class="outline-4">
<h4 id="orga930042"><span class="section-number-4">9.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-orgfa296c3" class="outline-4">
<h4 id="orgfa296c3"><span class="section-number-4">9.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-org5606a7c" class="outline-2">
<h2 id="org5606a7c"><span class="section-number-2">10.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-10">
<p>
Suspended for now.
</p>
</div>
<div id="outline-container-orgc4fb97d" class="outline-3">
<h3 id="orgc4fb97d"><span class="section-number-3">10.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-org253388d" class="outline-4">
<h4 id="org253388d"><span class="section-number-4">10.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-orga5d3e99" class="outline-4">
<h4 id="orga5d3e99"><span class="section-number-4">10.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org2ce9ee0" class="outline-4">
<h4 id="org2ce9ee0"><span class="section-number-4">10.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-org19e11b8" class="outline-2">
<h2 id="org19e11b8"><span class="section-number-2">11.</span> wktcolor</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgf0e76a3" class="outline-3">
<h3 id="orgf0e76a3"><span class="section-number-3">11.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-11-1">
</div>
<div id="outline-container-orgb552341" class="outline-4">
<h4 id="orgb552341"><span class="section-number-4">11.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-11-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org403a85f" class="outline-2">
<h2 id="org403a85f"><span class="section-number-2">12.</span> wktplot</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org8ae18a1" class="outline-3">
<h3 id="org8ae18a1"><span class="section-number-3">12.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-12-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-org1af3d97" class="outline-2">
<h2 id="org1af3d97"><span class="section-number-2">13.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgba5e54d" class="outline-3">
<h3 id="orgba5e54d"><span class="section-number-3">13.1.</span> Next step</h3>
<div class="outline-text-3" id="text-13-1">
</div>
<div id="outline-container-orgd1d3c5f" class="outline-4">
<h4 id="orgd1d3c5f"><span class="section-number-4">13.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-org39412fa" class="outline-2">
<h2 id="org39412fa"><span class="section-number-2">14.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org60d2c89" class="outline-3">
<h3 id="org60d2c89"><span class="section-number-3">14.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-14-1">
</div>
<div id="outline-container-org4de8c7f" class="outline-4">
<h4 id="org4de8c7f"><span class="section-number-4">14.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-org56bef99" class="outline-2">
<h2 id="org56bef99"><span class="section-number-2">15.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-orgca3fd04" class="outline-3">
<h3 id="orgca3fd04"><span class="section-number-3">15.1.</span> Need to think about adding floating point support</h3>
</div>
<div id="outline-container-org2b96571" class="outline-3">
<h3 id="org2b96571"><span class="section-number-3">15.2.</span> Port to non-Linux OS</h3>
</div>
</div>
<div id="outline-container-org81ab5bb" class="outline-2">
<h2 id="org81ab5bb"><span class="section-number-2">16.</span> Swocer</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-orgf6ca298" class="outline-3">
<h3 id="orgf6ca298"><span class="section-number-3">16.1.</span> Most crashing addressed</h3>
<div class="outline-text-3" id="text-16-1">
<p>
Nullified 'handle' API free functions helped a lot.
Still see some errors in operations.
</p>
</div>
</div>
<div id="outline-container-orgf5faa45" class="outline-3">
<h3 id="orgf5faa45"><span class="section-number-3">16.2.</span> Added outline for 'bottle' test</h3>
<div class="outline-text-3" id="text-16-2">
<p>
Added all functions believed to be needed for 'bottle' demo test.
Test doesn't pass so is disabled.
</p>
</div>
</div>
<div id="outline-container-orgfb4932d" class="outline-3">
<h3 id="orgfb4932d"><span class="section-number-3">16.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-16-3">
<p>
Swocer future.
Check out what's needed for gears.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
